[
    {
        "name": "1C Enterprise",
        "info": "1C:Enterprise is a universal cloud and on-premise system of programs for automating a company’s financial and wider operational activities. ",
        "src": "https://1c-dn.com/1c_enterprise/what_is_1c_enterprise/"
    },
    {
        "name": "4D",
        "info": "The 4D built-in language, consisting of more than 1300 commands, makes 4D a powerful development tool for web, mobile, or desktop applications. You can use the 4D language for many different tasks—from performing simple calculations to creating complex custom user interfaces.",
        "src": "https://doc4d.github.io/docs/next/Concepts/about/"
    },
    {
        "name": "ABAP",
        "info": "Advanced Business Application Programming (APAB) is the primary programming language supported on the SAP NetWeaver ABAP application server platform and applications that run on it, such as SAP ERP (formerly R/3), S/4HANA and CRM.",
        "src": "https://help.sap.com/doc/abapdocu_latest_index_htm/latest/en-US/abenabap_overview.htm"
    },
    {
        "name": "ABNF",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "AGS Script",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "AL",
        "info": "AL (Application Language) is used for business applications in Microsoft Dynamics 365 Business Central, allowing data manipulation and control over application objects for consistent business operations.",
        "src": "https://learn.microsoft.com/en-us/dynamics365/business-central/dev-itpro/developer/devenv-programming-in-al"
    },
    {
        "name": "AMPL",
        "info": "AMPL (A Mathematical Programming Language) is a high-level language designed for expressing optimization models and solving complex problems in linear, nonlinear, and integer optimization widely used in both academia and industry.",
        "src": "https://ampl.com"
    },
    {
        "name": "ANTLR",
        "info": "ANTLR (Another Tool for Language Recognition) is a powerful parser generator used to build languages, tools, and frameworks, generating parsers that can process, execute, or translate structured text or binary files.",
        "src": "https://www.antlr.org/"
    },
    {
        "name": "API Blueprint",
        "info": "API Blueprint is a high-level language for web API design and documentation. It provides a syntax to describe HTTP APIs, allowing a user to define a format with metadata, endpoint descriptions, request parameters, and response attributes.",
        "src": "https://apiblueprint.org/"
    },
    {
        "name": "APL",
        "info": "APL (A Programming Language) is known for its concise syntax using special characters and array programming capabilities, making it powerful for mathematical and other high-level computational tasks.",
        "src": "https://www.dyalog.com/"
    },
    {
        "name": "ASL",
        "info": "ASL (Adobe Source Libraries) provides a collection of C++ libraries designed to construct industrial-strength application software. It emphasizes modern software engineering practices to minimize bugs and improve quality.",
        "src": "https://opensource.adobe.com/asl/"
    },
    {
        "name": "ASN.1",
        "info": "ASN.1 (Abstract Syntax Notation One) is a standard and flexible notation that describes data structures for representing, encoding, transmitting, and decoding data in telecommunications and computer networking.",
        "src": "https://www.itu.int/en/ITU-T/asn1/Pages/introduction.aspx"
    },
    {
        "name": "ASP.NET",
        "info": "ASP.NET is an open-source server-side web application framework designed for web development to produce dynamic web pages developed by Microsoft to allow programmers to build dynamic web sites, applications, and services.",
        "src": "https://dotnet.microsoft.com/en-us/apps/aspnet"
    },
    {
        "name": "ATS",
        "info": "ATS is a statically typed programming language that unifies implementation with formal specification. It is designed to provide highly efficient type-checking and to support formal reasoning of programs through types.",
        "src": "http://www.ats-lang.org/"
    },
    {
        "name": "ActionScript",
        "info": "ActionScript is an object-oriented programming language originally developed by Macromedia Inc. (now discontinued by Adobe Systems). It is primarily used for the development of websites and software targeting the Adobe Flash Player platform.",
        "src": "https://helpx.adobe.com/support/flash.html"
    },
    {
        "name": "Ada",
        "info": "A structured, statically typed programming language designed for large and complex systems, with a focus on safety and reliability.",
        "src": "https://www.adacore.com/about-ada"
    },
    {
        "name": "Adobe Font Metrics",
        "info": "Adobe Font Metrics (AFM) files describe the visual characteristics of fonts, supporting precise text layout and rendering in applications.",
        "src": "https://adobe-type-tools.github.io/font-tech-notes/"
    },
    {
        "name": "Agda",
        "info": "Agda is a dependently typed functional programming language, emphasizing proofs of correctness and advanced type system features to ensure program reliability.",
        "src": "https://agda.readthedocs.io/en/latest/"
    },
    {
        "name": "Alloy",
        "info": "Alloy is a declarative modeling language for expressing complex structural constraints and behavior in software systems, facilitating the analysis and understanding of system architectures.",
        "src": "https://alloytools.org/"
    },
    {
        "name": "Alpine Abuild",
        "info": "Alpine Abuild is a tool used in the Alpine Linux distribution to compile source packages into installable binary packages, part of the Alpine package management system.",
        "src": "https://wiki.alpinelinux.org/wiki/Abuild_and_Helpers"
    },
    {
        "name": "Altium Designer",
        "info": "Altium Designer is a PCB and electronic design automation software package, providing tools for 3D PCB design and embedded system development.",
        "src": "https://www.altium.com/altium-designer/"
    },
    {
        "name": "AngelScript",
        "info": "AngelScript is an embeddable scripting language optimized for real-time applications, often used in game development for its performance and robust typing system.",
        "src": "https://www.angelcode.com/angelscript/"
    },
    {
        "name": "Ant Build System",
        "info": "The Ant Build System is a Java-based build tool that simplifies the software build process by managing dependencies and directing the build process.",
        "src": "https://ant.apache.org/"
    },
    {
        "name": "ApacheConf",
        "info": "ApacheConf is the configuration language used by the Apache HTTP Server, allowing the server's behavior to be customized through directives in configuration files.",
        "src": "https://httpd.apache.org/docs/"
    },
    {
        "name": "Apex",
        "info": "Apex is a strongly typed, object-oriented programming language that allows Salesforce developers to execute flow and transaction control statements on the Salesforce platform.",
        "src": "https://developer.salesforce.com/docs/atlas.en-us.apexcode.meta/apexcode/"
    },
    {
        "name": "Apollo Guidance Computer",
        "info": "The Apollo Guidance Computer (AGC) was an early digital computer designed to control the Apollo spacecraft's navigation and guidance systems during lunar missions.",
        "src": "https://airandspace.si.edu/stories/editorial/apollo-guidance-computer-and-first-silicon-chips"
    },
    {
        "name": "AppleScript",
        "info": "AppleScript is a scripting language created by Apple Inc., designed to automate complex sequences of tasks and customize the functionality of macOS applications.",
        "src": "https://developer.apple.com/library/archive/documentation/AppleScript/Conceptual/AppleScriptLangGuide/introduction/ASLR_intro.html"
    },
    {
        "name": "Arc",
        "info": "Arc is a dialect of the Lisp programming language, designed to explore the boundaries of what a minimal, expressive Lisp can be.",
        "src": "http://arclanguage.org/"
    },
    {
        "name": "AsciiDoc",
        "info": "AsciiDoc is a human-readable document format, semantically equivalent to DocBook XML, but using plain text markups for documentation and other texts.",
        "src": "https://asciidoc.org/"
    },
    {
        "name": "AspectJ",
        "info": "AspectJ is an aspect-oriented programming (AOP) language designed to cleanly modularize cross-cutting concerns in Java applications.",
        "src": "https://www.eclipse.org/aspectj/"
    },
    {
        "name": "Assembly",
        "info": "Assembly languages are low-level programming languages that are closely correlated to the machine code instructions specific to a computer's architecture.",
        "src": "https://www.tutorialspoint.com/assembly_programming/assembly_introduction.htm"
    },
    {
        "name": "Asymptote",
        "info": "Asymptote is a descriptive vector graphics language that provides a natural coordinate-based framework for technical drawing in 2D and 3D.",
        "src": "https://asymptote.sourceforge.io/"
    },
    {
        "name": "Augeas",
        "info": "Augeas is a configuration editing tool and programming language that parses configuration files and allows automated changes without altering the file's formatting.",
        "src": "http://augeas.net/"
    },
    {
        "name": "AutoHotkey",
        "info": "AutoHotkey is a scripting language for Windows that allows users to automate desktop tasks and create hotkeys for frequently performed actions.",
        "src": "https://www.autohotkey.com/"
    },
    {
        "name": "AutoIt",
        "info": "AutoIt is a freeware automation language for Windows aimed at automating the Windows GUI and general scripting to automate repetitive tasks.",
        "src": "https://www.autoitscript.com/site/autoit/"
    },
    {
        "name": "Avro IDL",
        "info": "Avro IDL is an interface definition language that allows the definition of Avro schemas, which are then used for serializing and deserializing data in a compact binary format.",
        "src": "https://avro.apache.org/docs/current/spec.html"
    },
    {
        "name": "Awk",
        "info": "Awk is a domain-specific language designed for text processing and typically used as a data extraction and reporting tool.",
        "src": "https://www.gnu.org/software/gawk/manual/gawk.html"
    },
    {
        "name": "Ballerina",
        "info": "Ballerina is an open-source, cloud-native programming language optimized for integration. It is designed to simplify how developers build and deploy microservices and integrations. With built-in support for network interactions and data handling, Ballerina facilitates coding in a sequence diagram-based graphical view as well.",
        "src": "https://ballerina.io/"
    },
    {
        "name": "Batchfile",
        "info": "Batchfile, or batch scripts, are scripts executed by Windows command-line interpreters such as cmd.exe. They are used for automating tasks on Windows, leveraging command-line instructions and batch-specific scripting features.",
        "src": "https://steve-jansen.github.io/guides/windows-batch-scripting/"
    },
    {
        "name": "Befunge",
        "info": "Befunge is an esoteric programming language known for its unusual two-dimensional code layout, where instructions are executed in a grid, allowing for multi-directional flow of control.",
        "src": "https://esolangs.org/wiki/Befunge"
    },
    {
        "name": "Bison",
        "info": "Bison is a general-purpose parser generator that converts a grammar description for an LALR(1) context-free grammar into a C program to parse that grammar.",
        "src": "https://www.gnu.org/software/bison/"
    },
    {
        "name": "BitBake",
        "info": "BitBake is a make-like build tool with the special focus of distributions and packages for embedded Linux cross-compilation.",
        "src": "https://www.yoctoproject.org/docs/latest/bitbake-user-manual/bitbake-user-manual.html"
    },
    {
        "name": "Blade",
        "info": "Blade is a simple, yet powerful templating engine provided with Laravel, which does not restrict you from using plain PHP code in your views.",
        "src": "https://laravel.com/docs/8.x/blade"
    },
    {
        "name": "BlitzBasic",
        "info": "BlitzBasic, also known as Blitz3D, BlitzPlus, or BlitzMax, is a family of game programming languages that are designed to cater to novice programmers.",
        "src": "https://blitzresearch.itch.io/"
    },
    {
        "name": "BlitzMax",
        "info": "BlitzMax is a variant of the Blitz programming languages, which extends the capabilities of its predecessor by offering more advanced programming features and a module system.",
        "src": "https://blitzresearch.itch.io/blitzmax"
    },
    {
        "name": "Bluespec",
        "info": "Bluespec is a high-level hardware description language that generates synthesizable Verilog from formal specifications, emphasizing correctness and synthesis.",
        "src": "https://bluespec.com/"
    },
    {
        "name": "Boo",
        "info": "Boo is an object-oriented, statically typed programming language for the .NET Framework with a python-inspired syntax and a special focus on language and compiler extensibility.",
        "src": "https://github.com/boo-lang/boo"
    },
    {
        "name": "Brainfuck",
        "info": "Brainfuck is an esoteric programming language created for extreme minimalism and is noted for its lack of commands, consisting only of eight simple commands and an instruction pointer.",
        "src": "https://esolangs.org/wiki/Brainfuck"
    },
    {
        "name": "Brightscript",
        "info": "Brightscript is a scripting language designed specifically for Roku development, enabling developers to build applications for the Roku streaming platform.",
        "src": "https://developer.roku.com/docs/references/brightscript/language/brightscript-language-reference.md"
    },
    {
        "name": "C",
        "info": "C is a general-purpose programming language developed in 1972 by Dennis Ritchie at Bell Labs. It's known for its efficiency and control, widely used in system and application development, including operating systems, databases, and more.",
        "src": "https://en.cppreference.com/w/c/language"
    },
    {
        "name": "C#",
        "info": "C# (C-Sharp) is an object-oriented programming language developed by Microsoft as part of its .NET initiative. It's designed to be modern, easy to learn, and to support robust software development with strong type checking and range checking.",
        "src": "https://docs.microsoft.com/en-us/dotnet/csharp/"
    },
    {
        "name": "C++",
        "info": "C++ is a statically typed, compiled, general-purpose programming language that is an extension of the C language. It supports object-oriented, procedural, and generic programming, making it highly flexible and adaptable for large-scale software infrastructures.",
        "src": "https://en.cppreference.com/w/cpp/language"
    },
    {
        "name": "CLIPS",
        "info": "CLIPS (C Language Integrated Production System) is a rule-based programming language developed at NASA for creating expert systems, emphasizing heuristic solutions over algorithmic ones.",
        "src": "https://www.clipsrules.net/"
    },
    {
        "name": "CMake",
        "info": "CMake is a cross-platform free and open-source software for managing the build processes of software using a compiler-independent method, supporting directory hierarchies and applications.",
        "src": "https://cmake.org/"
    },
    {
        "name": "COBOL",
        "info": "COBOL (Common Business-Oriented Language) is a high-level language for business data processing and batch processing applications, known for its simplicity, robustness, and business application nature.",
        "src": "https://open-cobol.sourceforge.io/"
    },
    {
        "name": "CSON",
        "info": "CSON (CoffeeScript-Object-Notation) is a syntax for structured data, akin to JSON, using CoffeeScript object literals for a more expressive and concise data representation.",
        "src": "https://github.com/bevry/cson"
    },
    {
        "name": "CSS",
        "info": "CSS (Cascading Style Sheets) is a style sheet language used for describing the presentation of a document written in HTML or XML, including colors, layout, and fonts.",
        "src": "https://developer.mozilla.org/en-US/docs/Web/CSS"
    },
    {
        "name": "CSV",
        "info": "CSV (Comma-Separated Values) is a simple file format used to store tabular data, such as a spreadsheet or database. Each line in the file corresponds to a row in the table, and columns are separated by commas.",
        "src": "https://www.rfc-editor.org/rfc/rfc4180"
    },
    {
        "name": "CWeb",
        "info": "CWeb combines the programming language C with LaTeX, allowing users to write programs and documentation in one source file. It's a form of literate programming pioneered by Donald Knuth.",
        "src": "https://www-cs-faculty.stanford.edu/~knuth/cweb.html"
    },
    {
        "name": "Cap'n Proto",
        "info": "Cap'n Proto is a data interchange format and capability-based RPC system that is extremely efficient, allowing for the serialization and deserialization of structured data without parsing.",
        "src": "https://capnproto.org/"
    },
    {
        "name": "CartoCSS",
        "info": "CartoCSS is a styling language based on CSS to design beautiful maps, primarily used within the CartoDB platform for geographic data visualization.",
        "src": "https://carto.com/"
    },
    {
        "name": "Ceylon",
        "info": "Ceylon is a programming language optimized for modularity and tooling that offers great fluency to write structured and scalable programs. It was designed by Red Hat.",
        "src": "https://ceylon-lang.org/"
    },
    {
        "name": "Chapel",
        "info": "Chapel is a programming language designed for productive parallel computing on large-scale systems. It supports data parallelism, task parallelism, and a global namespace to manage concurrency effectively across different computational architectures.",
        "src": "https://chapel-lang.org/"
    },
    {
        "name": "Charity",
        "info": "Charity is a purely functional programming language based on category theory. It emphasizes mathematical proofs and its compiler ensures that every program written in it terminates.",
        "src": "https://en.wikipedia.org/wiki/Charity_(programming_language)"
    },
    {
        "name": "ChucK",
        "info": "ChucK is a programming language for real-time sound synthesis and music creation. It introduces a unique time-based, concurrent programming model that provides precise control over time and audio computation.",
        "src": "https://chuck.cs.princeton.edu/"
    },
    {
        "name": "Cirru",
        "info": "Cirru is an expression-based programming language that aims to simplify syntax and make code visually clearer. It is primarily used for transforming data with its minimalistic structure.",
        "src": "http://cirru.org/"
    },
    {
        "name": "Clarion",
        "info": "Clarion is a data-centric Advanced Rapid Application Development (ARAD) language and environment used to develop database applications. It is known for its templating language and integrated development environment which helps in generating code.",
        "src": "https://www.softvelocity.com/"
    },
    {
        "name": "Classic ASP",
        "info": "Classic ASP (Active Server Pages) is Microsoft's server-side script engine for dynamically-generated web pages with an emphasis on ease of use and quick development.",
        "src": "https://docs.microsoft.com/en-us/previous-versions/iis/6.0-sdk/ms524929(v=vs.90)"
    },
    {
        "name": "Clean",
        "info": "Clean is a functional programming language designed for portability and efficiency, similar to Haskell. It is distinguished by its unique approach to dealing with mutable state.",
        "src": "https://clean.cs.ru.nl/Clean"
    },
    {
        "name": "Click",
        "info": "Click is a modular router software architecture designed to run on UNIX-like operating systems. It is configurable and used primarily for network research.",
        "src": "https://github.com/kohler/click"
    },
    {
        "name": "Clojure",
        "info": "Clojure is a modern, functional dialect of Lisp on the Java platform. Known for its robust concurrency tools and immutable data structures, it emphasizes functional programming.",
        "src": "https://clojure.org/"
    },
    {
        "name": "Closure Templates",
        "info": "Closure Templates are a client- and server-side templating system that helps you dynamically build reusable HTML and UI elements. They are part of the Closure Tools.",
        "src": "https://developers.google.com/closure/templates/"
    },
    {
        "name": "Cloud Firestore Security Rules",
        "info": "Cloud Firestore Security Rules provide a flexible, declarative language to secure access to documents in Google Cloud Firestore. They allow fine-grained control over database operations.",
        "src": "https://firebase.google.com/docs/firestore/security/get-started"
    },
    {
        "name": "CodeQL",
        "info": "CodeQL is a semantic code analysis engine used to automate security checks. It enables developers to perform queries on codebases as if they were data.",
        "src": "https://securitylab.github.com/tools/codeql"
    },
    {
        "name": "CoffeeScript",
        "info": "CoffeeScript is a little language that compiles into JavaScript. It provides better syntax avoiding the quirky parts of JavaScript, allowing clearer expression of concepts.",
        "src": "https://coffeescript.org/"
    },
    {
        "name": "ColdFusion",
        "info": "ColdFusion is a commercial rapid web-application development platform invented by JJ Allaire in 1995. It is known for its associated scripting language, ColdFusion Markup Language (CFML), which is syntactically similar to HTML.",
        "src": "https://helpx.adobe.com/coldfusion/user-guide.html"
    },    
    {
        "name": "ColdFusion CFC",
        "info": "ColdFusion Components (CFCs) enable object-oriented programming techniques in ColdFusion, allowing developers to encapsulate related functions into single components, enhancing security, performance, and reusability.",
        "src": "https://www.quackit.com/coldfusion/tutorial/coldfusion_components.cfm"
    },
    {
        "name": "Common Lisp",
        "info": "Common Lisp is a multi-paradigm programming language that supports procedural, functional, and object-oriented programming, known for its flexibility and extensibility.",
        "src": "https://common-lisp.net/"
    },
    {
        "name": "Common Workflow Language",
        "info": "The Common Workflow Language (CWL) is an open standard for describing analysis workflows and tools in a way that makes them portable and scalable across a variety of software and hardware environments.",
        "src": "https://www.commonwl.org/"
    },
    {
        "name": "Component Pascal",
        "info": "Component Pascal is a descendant of the Oberon-2 programming language, designed for building components and applications. It is a small, fast, and safe language.",
        "src": "https://www.componentpascal.org/"
    },
    {
        "name": "Cool",
        "info": "Cool (Classroom Object Oriented Language) is a language designed for use in an introductory programming course at the undergraduate level, focusing on features found in modern programming languages.",
        "src": "https://web.stanford.edu/class/cs143/"
    },
    {
        "name": "Coq",
        "info": "Coq is a formal proof management system, providing a formal language to write mathematical definitions, executable algorithms, and theorems, together with an environment for semi-interactive development of machine-checked proofs.",
        "src": "https://coq.inria.fr/"
    },
    {
        "name": "Creole",
        "info": "Creole is a lightweight markup language aimed at bridging the differences in wiki markup, making it easier to transfer content across different wikis without losing information.",
        "src": "https://www.wikicreole.org/"
    },
    {
        "name": "Crystal",
        "info": "Crystal is a programming language that aims to provide a balance between high-level abstractions and low-level performance, with a syntax similar to Ruby but statically typed and compiled.",
        "src": "https://crystal-lang.org/"
    },
    {
        "name": "Csound",
        "info": "Csound is a sound and music computing system providing a collection of music synthesis and signal processing facilities, designed for sound designers and musicians.",
        "src": "https://csound.com/"
    },
    {
        "name": "Cuda",
        "info": "CUDA is a parallel computing platform and application programming interface model created by Nvidia, allowing software developers to use a CUDA-enabled graphics processing unit (GPU) for general purpose processing.",
        "src": "https://developer.nvidia.com/cuda-zone"
    },
    {
        "name": "Cycript",
        "info": "Cycript is a programming language that allows developers to explore and modify running applications on either iOS or macOS using a hybrid of Objective-C and JavaScript syntax.",
        "src": "http://www.cycript.org/"
    },
    {
        "name": "Cython",
        "info": "Cython is a programming language that makes writing C extensions for the Python language as easy as Python itself, aimed at creating fast C code from Python logic.",
        "src": "https://cython.org/"
    },
    {
        "name": "D",
        "info": "D is a general-purpose programming language with static typing, systems-level access, and C-like syntax. It combines efficiency, control, and modeling power with safety and programmer productivity.",
        "src": "https://dlang.org/"
    },
    {
        "name": "DIGITAL Command Language",
        "info": "The DIGITAL Command Language (DCL) is the standard command language used on VAX, Alpha, and Itanium-based systems running the OpenVMS operating system.",
        "src": "https://vmssoftware.com/docs/user_guide/UGV041.html"
    },
    {
        "name": "DM",
        "info": "DM, the Dream Maker language, is used in the creation of games on the BYOND platform. It supports networking, databases, and interfaces for complex game creation.",
        "src": "https://www.byond.com/docs/guide/"
    },
    {
        "name": "DNS Zone",
        "info": "DNS Zone files are plain text files that represent the mapping between domain names and IP addresses. They contain directives and resource records, detailing domains, subdomains, and IP addresses.",
        "src": "https://www.iana.org/help/dns-zone-file"
    },
    {
        "name": "DTrace",
        "info": "DTrace is a comprehensive dynamic tracing framework originally created by Sun Microsystems. It is designed for troubleshooting kernel and application problems on production systems in real time.",
        "src": "https://en.wikipedia.org/wiki/DTrace"
    },
    {
        "name": "Dafny",
        "info": "Dafny is a programming language and program verifier, designed to support the static verification of programs to prove their correctness.",
        "src": "https://dafny-lang.github.io/dafny/"
    },
    {
        "name": "Darcs Patch",
        "info": "Darcs is a distributed revision control system that uses a unique patch-based approach allowing for asynchronous and independent work within the same project.",
        "src": "http://darcs.net/"
    },
    {
        "name": "Dart",
        "info": "Dart is a client-optimized language for fast apps on any platform, developed by Google. It is used to build mobile, desktop, server, and web applications.",
        "src": "https://dart.dev/guides"
    },
    {
        "name": "DataWeave",
        "info": "DataWeave is a powerful transformation language introduced by MuleSoft for data integration on the Anypoint Platform, designed to transform complex data structures.",
        "src": "https://docs.mulesoft.com/dataweave/"
    },
    {
        "name": "Dhall",
        "info": "Dhall is a programmable configuration language optimized for maintainability and safety, designed to avoid some of the common pitfalls of dealing with configuration files.",
        "src": "https://dhall-lang.org/"
    },
    {
        "name": "Diff",
        "info": "Diff is a file comparison tool that is used to show the differences between two files, or each corresponding file in two directories.",
        "src": "https://www.gnu.org/software/diffutils/manual/diffutils.html#Invoking-diff"
    },
    {
        "name": "DirectX 3D File",
        "info": "DirectX 3D files, typically with extensions like .x, are used to represent 3D modeling data and are commonly associated with Microsoft's DirectX technology.",
        "src": "https://docs.microsoft.com/en-us/windows/win32/direct3d9/dx9-graphics"
    },
    {
        "name": "Dockerfile",
        "info": "A Dockerfile is a script composed of various commands and arguments listed successively to automatically perform actions on a base image to create a new one.",
        "src": "https://docs.docker.com/engine/reference/builder/"
    },
    {
        "name": "Dogescript",
        "info": "Dogescript is a whimsical programming language that is inspired by the popular 'Doge' meme, featuring a playful syntax resembling the doge's internal monologue.",
        "src": "https://dogescript.io/"
    },
    {
        "name": "Dylan",
        "info": "Dylan is a multi-paradigm programming language that includes support for functional and object-oriented programming, designed to deliver high-performance executable code.",
        "src": "https://opendylan.org/"
    },
    {
        "name": "E",
        "info": "E is an object-capability programming language for secure distributed computing.",
        "src": "https://erights.org/"
    },
    {
        "name": "EBNF",
        "info": "Extended Backus-Naur Form (EBNF) is a notation for formally describing syntax as a set of derivation rules, which describe how symbols of the language are related to each other.",
        "src": "https://www.iso.org/standard/26153.html"
    },
    {
        "name": "ECL",
        "info": "ECL is a data-centric declarative programming language optimized for large-scale data management and query processing and forms the foundation of the HPCC Systems platform.",
        "src": "https://hpccsystems.com/training/documentation/ecl-language-reference"
    },
    {
        "name": "EJS",
        "info": "Embedded JavaScript templates (EJS) is a simple templating language that lets you generate HTML markup with plain JavaScript.",
        "src": "https://ejs.co/"
    },
    {
        "name": "EML",
        "info": "EML (Email Markup Language) represents electronic mail messages containing plain text, hyperlinks, attachments, and other data via standardized encoding techniques.",
        "src": "https://en.wikipedia.org/wiki/Email"
    },
    {
        "name": "EQ",
        "info": "EQ, also known as Eqela, is a programming language that evolved into the Sling language. It is designed to enhance developer productivity and quality of software through a design that emphasizes simplicity and efficiency.",
        "src": "https://www.markkukero.com/2017-01-introducing-the-sling-programming-language/"
    },
    {
        "name": "Eagle",
        "info": "Eagle is not specifically a programming language but often relates to the Eagle PCB design software, used for creating printed circuit board layouts.",
        "src": "https://www.autodesk.com/products/eagle/overview"
    },
    {
        "name": "Ecere Projects",
        "info": "The Ecere IDE and SDK feature the Ecere programming language, which is designed to be straightforward and efficient, supporting object-oriented and procedural programming.",
        "src": "https://www.ecere.com/"
    },
    {
        "name": "Edje Data Collection",
        "info": "Edje is not a programming language but a part of the Enlightenment Foundation Libraries, used for creating complex graphical layouts and animations in applications.",
        "src": "https://www.enlightenment.org/about-edje"
    },
    {
        "name": "Eiffel",
        "info": "Eiffel is an object-oriented programming language that emphasizes software reliability and reusability, known for its Design by Contract approach to ensure software correctness.",
        "src": "https://www.eiffel.org/"
    },
    {
        "name": "Elixir",
        "info": "Elixir is a dynamic, functional language designed for building scalable and maintainable applications, leveraging the Erlang VM, known for running low-latency, distributed systems.",
        "src": "https://elixir-lang.org/"
    },
    {
        "name": "Elm",
        "info": "Elm is a functional language that compiles to JavaScript, making it ideal for developing reliable web applications with a strong emphasis on simplicity and quality tooling.",
        "src": "https://elm-lang.org/"
    },
    {
        "name": "Emacs Lisp",
        "info": "Emacs Lisp is a dialect of the Lisp programming language used as a scripting language by the Emacs text editor, allowing for customization and extension of Emacs capabilities.",
        "src": "https://www.gnu.org/software/emacs/manual/html_node/elisp/"
    },
    {
        "name": "EmberScript",
        "info": "EmberScript is a CoffeeScript-derived scripting language that compiles to JavaScript, designed to enhance the productivity of developing ambitious web applications using the Ember.js framework.",
        "src": "https://emberscript.com/"
    },
    {
        "name": "Erlang",
        "info": "Erlang is a programming language used to build massively scalable soft real-time systems with requirements on high availability. Erlang's runtime system has built-in support for concurrency, distribution, and fault tolerance.",
        "src": "https://www.erlang.org/"
    },
    {
        "name": "F#",
        "info": "F# is a strongly typed, functional-first programming language that also supports imperative and object-oriented programming. It runs on the .NET framework and is known for its concise and robust code style.",
        "src": "https://fsharp.org/"
    },
    {
        "name": "F*",
        "info": "F* is a functional programming language with effects aimed at program verification, offering a dependent type system and a verification tool that generates proofs of correctness.",
        "src": "https://www.fstar-lang.org/"
    },
    {
        "name": "FIGlet Font",
        "info": "FIGlet is a program for creating large text out of ordinary screen characters, often used in text-based user interfaces and online forums.",
        "src": "http://www.figlet.org/"
    },
    {
        "name": "FLUX",
        "info": "FLUX is not a programming language but may refer to various tools and technologies related to data flow or processing, such as the scripting language for InfluxDB.",
        "src": "https://www.influxdata.com/"
    },    
    {
        "name": "Factor",
        "info": "Factor is a concatenative, stack-based programming language influenced by Forth. It is designed for high-level features including dynamic types, macros, and garbage collection, aiming at simplicity and expressiveness with a full-featured library.",
        "src": "https://factorcode.org/"
    },
    {
        "name": "Fancy",
        "info": "Fancy is an object-oriented, dynamically typed programming language inspired by Ruby, Smalltalk, and Erlang with first-class continuations and an actor-based concurrency model.",
        "src": "https://fancy-lang.org/"
    },
    {
        "name": "Fantom",
        "info": "Fantom is a portable programming language designed to scale from shell scripts to large server-side applications. It features a familiar Java-like syntax, with static and dynamic typing capabilities.",
        "src": "https://fantom.org/"
    },
    {
        "name": "Faust",
        "info": "Faust (Functional Audio Stream) is a functional programming language specifically designed for real-time signal processing and synthesis. It provides a high-level approach to efficient sound synthesis.",
        "src": "https://faust.grame.fr/"
    },
    {
        "name": "Filebench WML",
        "info": "Filebench WML (Workload Modeling Language) is used within the Filebench framework to create models of file system and storage workloads for simulation and performance analysis.",
        "src": "https://github.com/filebench/filebench"
    },
    {
        "name": "Forth",
        "info": "Forth is a stack-based, procedural, imperative programming language known for its portability, compact syntax, and ability to directly manipulate memory and hardware.",
        "src": "https://www.forth.com/starting-forth/"
    },
    {
        "name": "Fortran",
        "info": "Fortran is a high-level language, originally developed by IBM in the 1950s for scientific and engineering applications. It excels in numerical computation and scientific computing.",
        "src": "https://gcc.gnu.org/fortran/"
    },
    {
        "name": "Fortran Free Form",
        "info": "Fortran Free Form refers to the modern syntax style of the Fortran programming language that allows greater flexibility in formatting than the older fixed form.",
        "src": "https://gcc.gnu.org/onlinedocs/gfortran/Free-Form.html"
    },
    {
        "name": "FreeMarker",
        "info": "FreeMarker is a template engine designed to generate text output based on templates. It is used primarily for generating HTML web pages or to source code generation.",
        "src": "https://freemarker.apache.org/"
    },
    {
        "name": "Frege",
        "info": "Frege is a purely functional programming language in the spirit of Haskell, running on the Java Virtual Machine and bringing functional programming to the Java platform.",
        "src": "https://github.com/Frege/frege"
    },
    {
        "name": "Futhark",
        "info": "Futhark is a data-parallel, purely functional programming language designed to be compiled to efficient GPU code, aiming at high-performance applications.",
        "src": "https://futhark-lang.org/"
    },
    {
        "name": "G-code",
        "info": "G-code is the common name for the most widely used numerical control (NC) programming language, which has many implementations. Used mainly in automation, it is part of the instruction set that directs a machine on how to operate.",
        "src": "https://www.reprap.org/wiki/G-code"
    },
    {
        "name": "GAML",
        "info": "GAML is a domain-specific language used within the GAMA modeling and simulation platform, designed to describe complex systems such as ecological and urban systems.",
        "src": "https://gama-platform.github.io/"
    },
    {
        "name": "GAMS",
        "info": "GAMS (General Algebraic Modeling System) is a high-level modeling system for mathematical programming problems, including optimization and microeconomic analysis.",
        "src": "https://www.gams.com/"
    },
    {
        "name": "GAP",
        "info": "GAP (Groups, Algorithms, Programming) is a system for computational discrete algebra with particular emphasis on computational group theory, aimed at solving complex mathematical problems.",
        "src": "https://www.gap-system.org/"
    },
    {
        "name": "GCC Machine Description",
        "info": "GCC Machine Description is not a programming language but part of the GCC compiler that describes machine-specific details in high-level code, allowing GCC to generate optimized output.",
        "src": "https://gcc.gnu.org/onlinedocs/gccint/Machine-Desc.html"
    },
    {
        "name": "GDB",
        "info": "GDB (GNU Debugger) is a powerful debugger for Unix-like systems, designed to help programmers see what is going on 'inside' another program while it executes or what another program was doing at the moment it crashed.",
        "src": "https://www.sourceware.org/gdb/current/onlinedocs/gdb/"
    },
    {
        "name": "GDScript",
        "info": "GDScript is a high-level, dynamically typed programming language used to create content within the Godot Engine. It's syntax and functionality are similar to Python, optimized for the creation of complex, interactive 3D and 2D games.",
        "src": "https://docs.godotengine.org/en/stable/tutorials/scripting/gdscript/gdscript_basics.html"
    },
    {
        "name": "GLSL",
        "info": "GLSL (OpenGL Shading Language) is used for writing shaders within OpenGL API, allowing for more control over the graphics pipeline and facilitating the creation of visually complex scenes in real-time applications.",
        "src": "https://www.khronos.org/opengl/wiki/Core_Language_(GLSL)"
    },
    {
        "name": "GN",
        "info": "GN is a meta-build system that generates NinjaBuild files. It's designed to be faster and simpler than GYP and is used by projects like Chromium for managing complex build configurations.",
        "src": "https://gn.googlesource.com/gn/"
    },
    {
        "name": "Game Maker Language",
        "info": "Game Maker Language (GML) is an interpreted programming language designed for use with the GameMaker Studio game creation system. It allows developers to create games in a simple programming environment.",
        "src": "https://manual.yoyogames.com/GameMaker_Language/GML_Overview.htm"
    },
    {
        "name": "Genie",
        "info": "Genie is a modern, high-level programming language similar in syntax to Python, Vala, and Pascal, with a focus on clean, object-oriented design and aims to bring such language features to GNOME developers.",
        "src": "https://wiki.gnome.org/Projects/Genie"
    },
    {
        "name": "Genshi",
        "info": "Genshi is a Python toolkit for generation of output for the web, focusing on XML-based templates. It is particularly aimed at web applications, providing an HTML/XML templating system.",
        "src": "https://genshi.edgewall.org/"
    },
    {
        "name": "Gentoo Ebuild",
        "info": "Gentoo Ebuild is a script used by the Portage package management system in Gentoo Linux to automate the building of software packages. Ebuild scripts specify metadata about the software and instructions for compiling and installing it.",
        "src": "https://devmanual.gentoo.org/ebuild-writing/"
    },
    {
        "name": "Gentoo Eclass",
        "info": "Gentoo Eclass files are framework extensions for Ebuild scripts, providing shared functions that help in code reuse among different Ebuilds in the Gentoo Linux distribution.",
        "src": "https://devmanual.gentoo.org/eclass-reference/"
    },
    {
        "name": "Gerber Image",
        "info": "Gerber Image files, referred to as Gerber files, are ASCII vector format files used in PCB design. They represent copper layers, solder mask, and other aspects of PCB design for manufacturing.",
        "src": "https://www.ucamco.com/files/downloads/file/81/the_gerber_file_format_specification.pdf"
    },
    {
        "name": "Gettext Catalog",
        "info": "Gettext Catalog files, typically with a .po extension, are used by the GNU 'gettext' localization framework. They contain translatable content of software projects enabling multi-language support.",
        "src": "https://www.gnu.org/software/gettext/manual/gettext.html#PO-Files"
    },
    {
        "name": "Gherkin",
        "info": "Gherkin is a domain-specific language for writing acceptance criteria in Behavior Driven Development (BDD). It allows expected software behaviors to be specified in a logical language that customers can understand.",
        "src": "https://cucumber.io/docs/gherkin/"
    },
    {
        "name": "Git Attributes",
        "info": "Git Attributes are a configuration mechanism for Git repository attributes. They allow you to specify attributes per path that affect how changes to those paths are recorded or checked out.",
        "src": "https://git-scm.com/book/en/v2/Customizing-Git-Git-Attributes"
    },
    {
        "name": "Git Config",
        "info": "Git Config is used to set configuration options for Git, including user preferences and project-specific settings across three levels: local, global, and system. This allows customization of Git behavior for individual projects or the entire system.",
        "src": "https://git-scm.com/docs/git-config"
    },
    {
        "name": "Glyph",
        "info": "Currently, there is no specific programming or scripting language named 'Glyph' commonly recognized. It might refer to glyph icons or graphical representations in software applications.",
        "src": "N/A"
    },
    {
        "name": "Gnuplot",
        "info": "Gnuplot is a portable command-line driven graphing utility for Linux, OS/2, MS Windows, OSX, VMS, and many other platforms. It is used to plot 2D and 3D data for scientific applications.",
        "src": "http://www.gnuplot.info/documentation.html"
    },
    {
        "name": "Go",
        "info": "Go is an open source programming language that makes it easy to build simple, reliable, and efficient software. It is statically typed with syntax and environment designed for efficiency, clarity, and safety.",
        "src": "https://golang.org"
    },
    {
        "name": "Golo",
        "info": "Golo is a simple dynamic, weakly-typed language for the JVM. It provides a lightweight feel with a high-performance runtime leveraging Java’s invokedynamic.",
        "src": "https://golo-lang.org/documentation/next/index.html"
    },
    {
        "name": "Gosu",
        "info": "Gosu is a statically typed programming language that runs on the Java Virtual Machine. Its design is geared towards simplicity and ease of use, with features from scripting languages.",
        "src": "https://gosu-lang.github.io/"
    },
    {
        "name": "Grace",
        "info": "Grace is an educational programming language that is classically object-oriented and designed to help novices learn about programming. Its design encourages the development of well-structured software.",
        "src": "http://gracelang.org/applications/"
    },
    {
        "name": "Gradle",
        "info": "Gradle is a powerful build system for the JVM. It is designed to support complex workflows involving compilation, packaging, and deployment of applications.",
        "src": "https://gradle.org/guides/"
    },
    {
        "name": "Grammatical Framework",
        "info": "Grammatical Framework (GF) is a programming language for creating multilingual translation systems. It separates the grammatical structure of a language from its lexical content, making it reusable across languages.",
        "src": "https://www.grammaticalframework.org/"
    },
    {
        "name": "Graph Modeling Language",
        "info": "Graph Modeling Language (GML) is a hierarchical ASCII-based file format for describing graphs. It is widely used in data visualization and network analysis software.",
        "src": "https://infosys.uni-saarland.de/publications/GML/gml-tr.pdf"
    },
    {
        "name": "GraphQL",
        "info": "GraphQL is a query language for APIs and a runtime for executing those queries by using a type system you define for your data. It provides a more efficient, powerful and flexible alternative to REST.",
        "src": "https://graphql.org/"
    },
    {
        "name": "Graphviz (DOT)",
        "info": "Graphviz is open source graph visualization software. Graph visualization is a way of representing structural information as diagrams of abstract graphs and networks.",
        "src": "https://graphviz.org/documentation/"
    },
    {
        "name": "Groovy",
        "info": "Groovy is an agile and dynamic language for the Java Virtual Machine. It builds upon the strengths of Java but has additional power features inspired by languages like Python, Ruby, and Smalltalk.",
        "src": "https://groovy-lang.org/documentation.html"
    },
    {
        "name": "Groovy Server Pages",
        "info": "Groovy Server Pages (GSP) is a view technology which allows mixing of Groovy code and HTML to generate dynamic web content in a similar way to Java Server Pages (JSP).",
        "src": "https://docs.groovy-lang.org/docs/next/html/documentation/template-engines.html#_groovy_server_pages_gsp"
    },    
    {
        "name": "HAProxy",
        "info": "HAProxy is a free, open source software that provides a high availability load balancer and proxy server for TCP and HTTP-based applications. It is particularly suited for web sites scaling out, ensuring high availability and performance.",
        "src": "https://www.haproxy.org/"
    },
    {
        "name": "HCL",
        "info": "HashiCorp Configuration Language (HCL) is a configuration language built by HashiCorp that's used in various HashiCorp tools, including Terraform, to combine configuration data with a scripting language to allow for dynamic builds.",
        "src": "https://www.terraform.io/docs/language/syntax/configuration.html"
    },
    {
        "name": "HLSL",
        "info": "High-Level Shading Language (HLSL) is a programming language for writing shaders used in computer graphics for applications such as video games. It works with DirectX to define the appearance of 3D and 2D models.",
        "src": "https://docs.microsoft.com/en-us/windows/win32/direct3dhlsl/dx-graphics-hlsl"
    },
    {
        "name": "HTML",
        "info": "HTML (Hypertext Markup Language) is the standard markup language used for creating web pages and web applications. It provides the basic structure of sites, which is enhanced and modified by other technologies like CSS and JavaScript.",
        "src": "https://developer.mozilla.org/en-US/docs/Web/HTML"
    },
    {
        "name": "HTML+Django",
        "info": "HTML+Django refers to the use of HTML in the Django web framework. Django templates use HTML for the layout and structure of a web page, enhanced by Django Template Language (DTL) for dynamic content generation.",
        "src": "https://docs.djangoproject.com/en/3.2/topics/templates/"
    },
    {
        "name": "HTTP",
        "info": "HTTP (Hypertext Transfer Protocol) is an application-layer protocol for transmitting hypermedia documents, such as HTML. It is the foundation of any data exchange on the Web and it is a client-server protocol.",
        "src": "https://developer.mozilla.org/en-US/docs/Web/HTTP"
    },
    {
        "name": "HXML",
        "info": "HXML files are configuration files used with the Haxe compiler. They specify options for building projects and can include commands like which Haxe files to compile, libraries to use, and output parameters.",
        "src": "https://haxe.org/manual/compiler-usage-hxml.html"
    },
    {
        "name": "Hack",
        "info": "Hack is a programming language for the HipHop Virtual Machine (HHVM), designed by Facebook to serve as a successor to PHP. Hack inter-operates seamlessly with PHP and offers type annotations for improved code quality.",
        "src": "https://hacklang.org/"
    },
    {
        "name": "Haml",
        "info": "Haml (HTML Abstraction Markup Language) is a templating engine designed to avoid writing inline code in a web document and to make the HTML cleaner. It's a markup language that's used to cleanly and simply describe the HTML of any web document without the use of inline code.",
        "src": "http://haml.info/"
    },
    {
        "name": "Handlebars",
        "info": "Handlebars is a popular templating engine that is powerful, mustache-compatible, and allows you to build semantic templates effectively with no frustration. It keeps the view and the code separated like we're used to doing with client-side JavaScript frameworks.",
        "src": "https://handlebarsjs.com/"
    },
    {
        "name": "Harbour",
        "info": "Harbour is an open-source compiler for the xBase superset language often used to build database applications. It is a cross-platform environment and is backward-compatible with most Clipper codebases.",
        "src": "https://harbour.github.io/"
    },
    {
        "name": "Haskell",
        "info": "Haskell is a standardized, general-purpose purely functional programming language, with non-strict semantics and strong static typing. It is known for its rich type system and lazy evaluation features.",
        "src": "https://www.haskell.org/"
    },
    {
        "name": "Haxe",
        "info": "Haxe is an open source toolkit based on a modern, high-level, strictly typed programming language, a cross-compiler, a complete cross-platform standard library and ways to access each platform's native capabilities.",
        "src": "https://haxe.org/"
    },
    {
        "name": "HiveQL",
        "info": "HiveQL is a query language used by Apache Hive, similar to SQL, designed for managing and querying large datasets residing in distributed storage using Apache Hadoop. It supports analysis, data summarization, and ad-hoc querying.",
        "src": "https://cwiki.apache.org/confluence/display/Hive/LanguageManual"
    },
    {
        "name": "HolyC",
        "info": "HolyC is the programming language for TempleOS, an operating system made by Terry A. Davis. It is a variation of C/C++ designed to work closely with the Temple Operating System.",
        "src": "https://templeos.holyc.xyz/Wb/Doc/HolyC.html"
    },
    {
        "name": "Hy",
        "info": "Hy is a dialect of Lisp that's embedded in Python. It aims to bring the expressive power of Lisp to Python's rich ecosystem, allowing Lisp code to interact seamlessly with Python modules.",
        "src": "https://docs.hylang.org/en/stable/"
    },
    {
        "name": "HyPhy",
        "info": "HyPhy (Hypothesis Testing using Phylogenies) is software designed to perform complex analyses of genetic sequence data and test evolutionary hypotheses. It is used primarily for the statistical analysis of DNA and protein sequences.",
        "src": "https://hyphy.org/"
    },
    {
        "name": "IDL",
        "info": "The Interactive Data Language (IDL) is a programming language used for data analysis, visualization, and cross-platform application development. It is popular in astronomy and other sciences and is known for its ease in handling large arrays of data.",
        "src": "https://www.l3harrisgeospatial.com/Software-Technology/IDL"
    },
    {
        "name": "IGOR Pro",
        "info": "IGOR Pro is a scientific data analysis software, providing advanced capabilities for data visualization, complex graphing, and sophisticated analysis for scientists and engineers.",
        "src": "https://www.wavemetrics.com/products/igorpro/igorpro.htm"
    },
    {
        "name": "INI",
        "info": "INI files are simple text files with a basic structure composed of sections, properties, and values, used extensively for configuration purposes by various software programs.",
        "src": "https://en.wikipedia.org/wiki/INI_file"
    },
    {
        "name": "Idris",
        "info": "Idris is a general-purpose functional programming language with dependent types, focused on proving properties of programs. It is similar to Haskell and aims at enabling practical programming with dependent types.",
        "src": "https://www.idris-lang.org/"
    },
    {
        "name": "Inform 7",
        "info": "Inform 7 is a design system for interactive fiction based on natural language, making it accessible to non-programmers. It allows for writing complex interactive stories and games.",
        "src": "http://inform7.com/"
    },
    {
        "name": "Inno Setup",
        "info": "Inno Setup is a free script-driven installation system created in Delphi by Jordan Russell. It is used for packaging and distributing Windows applications.",
        "src": "http://www.jrsoftware.org/isinfo.php"
    },
    {
        "name": "Io",
        "info": "Io is a pure object-oriented programming language inspired by Smalltalk, designed for creating prototypes and applications through its dynamic type system and powerful syntax.",
        "src": "https://iolanguage.org/"
    },
    {
        "name": "Ioke",
        "info": "Ioke is a dynamic, strongly typed, prototype-based programming language targeted at virtual machines, with a syntax and capabilities similar to Io but with influences from Ruby and Lisp.",
        "src": "https://ioke.org/"
    },
    {
        "name": "Isabelle",
        "info": "Isabelle is a popular generic proof assistant. It allows mathematical formulas to be expressed in a formal language and provides tools for proving those formulas within a logical calculus.",
        "src": "https://isabelle.in.tum.de/"
    },
    {
        "name": "J",
        "info": "J is an array programming language based primarily on APL but utilizing ASCII characters. It is suited for mathematical and statistical programming, especially when dealing with complex data.",
        "src": "https://www.jsoftware.com/"
    },
    {
        "name": "JFlex",
        "info": "JFlex is a lexical analyzer generator (also known as scanner generator) for Java, accepting a specification file containing regular expressions describing the tokens of the language and producing a Java program that reads an input stream and partitions it into tokens.",
        "src": "https://jflex.de/"
    },
    {
        "name": "JSON",
        "info": "JSON (JavaScript Object Notation) is a lightweight data-interchange format that is easy for humans to read and write and for machines to parse and generate. It is based on a subset of the JavaScript Programming Language and is commonly used for transmitting data in web applications.",
        "src": "https://www.json.org/json-en.html"
    },
    {
        "name": "JSON5",
        "info": "JSON5 is a superset of JSON that aims to alleviate some of the limitations of JSON by extending its syntax to include some productions from ECMAScript 5.1. It allows for more human-friendly JSON files, with features such as comments, trailing commas, and more.",
        "src": "https://json5.org/"
    },
    {
        "name": "JSONiq",
        "info": "JSONiq is a query and processing language specifically designed for JSON data. This language enables developers to process, transform, and query JSON data similarly to XML data using XQuery.",
        "src": "http://jsoniq.org/"
    },
    {
        "name": "Jasmin",
        "info": "Jasmin is an assembler for the Java Virtual Machine. It allows developers to create Java applets and applications in an assembly-like syntax by directly coding the JVM instruction set and directives.",
        "src": "https://jasmin.sourceforge.net/"
    },
    {
        "name": "Java",
        "info": "Java is a high-level, class-based, object-oriented programming language that is designed to have as few implementation dependencies as possible. It is a general-purpose programming language intended to let application developers write once, run anywhere (WORA).",
        "src": "https://www.oracle.com/java/"
    },
    {
        "name": "Java Properties",
        "info": "Java Properties files are used in Java programming to maintain project configuration data, database config or project settings etc. They are saved in a simple key-value format and can be read both by humans and through machine code.",
        "src": "https://en.wikipedia.org/wiki/.properties"
    },
    {
        "name": "Java Server Pages",
        "info": "Java Server Pages (JSP) is a technology that helps software developers create dynamically generated web pages based on HTML, XML, or other document types. Released in 1999 by Sun Microsystems, JSP is similar to PHP and ASP, but it uses the Java programming language.",
        "src": "https://www.oracle.com/java/technologies/jspt.html"
    },
    {
        "name": "JavaScript",
        "info": "JavaScript is a text-based programming language used both on the client-side and server-side that allows you to make web pages interactive. Where HTML and CSS are languages that give structure and style to web pages, JavaScript gives web pages interactive elements that engage a user.",
        "src": "https://developer.mozilla.org/en-US/docs/Web/JavaScript"
    },
    {
        "name": "Jolie",
        "info": "Jolie is an open-source programming language designed for building distributed applications, based on the paradigm of microservices. Each Jolie service is a stand-alone component that can communicate with other services asynchronously.",
        "src": "https://www.jolie-lang.org/"
    },
    {
        "name": "Jsonnet",
        "info": "Jsonnet is a data templating language for app and tool developers that extends JSON. It adds features such as variables, functions, conditionals and arithmetic, making it simpler to manage complex configurations.",
        "src": "https://jsonnet.org/"
    },
    {
        "name": "Julia",
        "info": "Julia is a high-level, high-performance dynamic programming language for technical computing, with syntax that is familiar to users of other technical computing environments. It provides a sophisticated compiler, distributed parallel execution, numerical accuracy, and an extensive mathematical function library.",
        "src": "https://julialang.org/"
    },
    {
        "name": "Jupyter Notebook",
        "info": "Jupyter Notebook is an open-source web application that allows you to create and share documents that contain live code, equations, visualizations, and narrative text. Uses include: data cleaning and transformation, numerical simulation, statistical modeling, data visualization, machine learning, and much more.",
        "src": "https://jupyter.org/"
    },
    {
        "name": "KRL",
        "info": "KRL (Kinetic Rule Language) is a programming language designed for building distributed applications, emphasizing event-driven and rule-based paradigms. It is used primarily in IoT and event-driven applications.",
        "src": "https://en.wikipedia.org/wiki/Kinetic_Rule_Language"
    },
    {
        "name": "Kaitai Struct",
        "info": "Kaitai Struct is a declarative language used for describing various binary data structures in a detailed and easy-to-understand format. It is designed to assist in parsing binary files, allowing the generation of parsers in various programming languages from a common description.",
        "src": "https://kaitai.io/"
    },
    {
        "name": "KiCad Layout",
        "info": "KiCad Layout refers to the part of the KiCad software suite used for designing printed circuit boards (PCBs). KiCad is an open-source project that provides tools for designing electronic schematic diagrams and circuit board layouts.",
        "src": "https://www.kicad.org/"
    },
    {
        "name": "KiCad Legacy Layout",
        "info": "KiCad Legacy Layout pertains to older versions of the KiCad software used for PCB design. These versions are maintained for compatibility and integration of older electronic design projects.",
        "src": "https://www.kicad.org/legacy/"
    },
    {
        "name": "KiCad Schematic",
        "info": "KiCad Schematic is a component of the KiCad EDA software suite used for creating electronic schematic diagrams. It is essential for mapping out the connections and layout before moving to the actual PCB design.",
        "src": "https://www.kicad.org/"
    },
    {
        "name": "Kit",
        "info": "Kit language is a minimal toolkit for HTML templating that's part of the CodeKit application, which provides web developers a powerful and flexible way to create complex web pages from simpler components.",
        "src": "https://incident57.com/codekit/help.html#kit"
    },
    {
        "name": "Kotlin",
        "info": "Kotlin is a modern statically typed programming language used for general-purpose development. Developed by JetBrains, it is fully interoperable with Java and aims to enhance developer productivity with its concise and expressive syntax.",
        "src": "https://kotlinlang.org/"
    },
    {
        "name": "LFE",
        "info": "Lisp Flavored Erlang (LFE) is a functional, concurrent, general-purpose programming language and Lisp dialect built on top of the Erlang Virtual Machine (BEAM). It combines the features of Erlang with the syntax of Lisp.",
        "src": "https://lfe.io/"
    },
    {
        "name": "LLVM",
        "info": "LLVM is a collection of modular and reusable compiler and toolchain technologies used to develop compiler front ends and back ends. It is designed for compile-time, link-time, run-time, and idle-time optimization of programs written in arbitrary programming languages.",
        "src": "https://llvm.org/"
    },
    {
        "name": "LOLCODE",
        "info": "LOLCODE is an esoteric programming language inspired by the lolcats internet meme. It is designed to resemble the speech of lolcats, being both humorous and easy to understand.",
        "src": "https://lolcode.org/"
    },
    {
        "name": "LSL",
        "info": "Linden Scripting Language (LSL) is used within the virtual world of Second Life. It enables the creation of interactive content, providing functions to control in-world objects, communicate with users, and connect with external servers.",
        "src": "https://wiki.secondlife.com/wiki/LSL_Portal"
    },
    {
        "name": "LTspice Symbol",
        "info": "LTspice is a SPICE-based analog electronic circuit simulator software by Analog Devices. It is used to simulate and design circuits before actual hardware implementation. LTspice Symbol refers to the symbolic representation used in these simulations.",
        "src": "https://www.analog.com/en/design-center/design-tools-and-calculators/ltspice-simulator.html"
    },
    {
        "name": "LabVIEW",
        "info": "LabVIEW is a system-design platform and development environment for a visual programming language from National Instruments. Primarily used for data acquisition, instrument control, and industrial automation on a variety of platforms.",
        "src": "https://www.ni.com/en-us/shop/labview.html"
    },
    {
        "name": "Lasso",
        "info": "Lasso is a programming language used mainly for web development. It integrates database access with HTML markup, offering a powerful tool for creating dynamic websites quickly.",
        "src": "https://www.lassosoft.com/"
    },
    {
        "name": "Latte",
        "info": "Latte is a template engine for PHP that provides a safer and more efficient way to separate the programming logic from the HTML content of web pages.",
        "src": "https://latte.nette.org/"
    },
    {
        "name": "Lean",
        "info": "Lean is a functional programming language designed for writing correct and maintainable code, also used as an interactive theorem prover. It supports defining types and functions, focusing on the problem domain rather than programming details. Lean includes features like type inference, first-class functions, and metaprogramming, and it allows for proving properties of functions.",
        "src": "https://lean-lang.org/about/"
    },
    {
        "name": "Less",
        "info": "Less is a backward-compatible language extension for CSS. It is dynamically processed on the server-side or client-side, which enhances CSS with variables, mixins, operations, and functions.",
        "src": "http://lesscss.org/"
    },
    {
        "name": "Lex",
        "info": "Lex is a program generator designed for lexical processing of text. It facilitates simple character pattern matching and tokenizing of input sequences and is typically used with the Yacc parser generator.",
        "src": "https://www.gnu.org/software/flex/manual/html_node/Introduction.html#Introduction"
    },
    {
        "name": "LilyPond",
        "info": "LilyPond is a music engraving program, devoted to producing high-quality sheet music. LilyPond is part of the GNU Project and operates as a compiler that processes music notation into beautifully formatted scores.",
        "src": "http://lilypond.org/"
    },
    {
        "name": "Limbo",
        "info": "Limbo is a programming language developed for the Inferno operating system, designed to support distributed systems and network communication in a safe manner. Limbo incorporates garbage collection, concurrency, and communication via channels.",
        "src": "https://inferno-os.org/"
    },
    {
        "name": "Linker Script",
        "info": "Linker scripts are used with GNU LD to control the link process. They dictate how sections of code and data are mapped to memory, influencing the behavior of the resulting executable.",
        "src": "https://sourceware.org/binutils/docs/ld/Scripts.html"
    },
    {
        "name": "Linux Kernel Module",
        "info": "Linux Kernel Modules are pieces of code that can be loaded and unloaded into the kernel upon demand. They extend the functionality of the kernel without the need to reboot the system.",
        "src": "https://www.tldp.org/LDP/lkmpg/2.6/html/lkmpg.html#AEN181"
    },
    {
        "name": "Liquid",
        "info": "Liquid is an open-source template language created by Shopify and written in Ruby. It is used as a safe, customer-facing template engine, allowing flexibility in customization without compromising the security of the main application.",
        "src": "https://shopify.github.io/liquid/"
    },
    {
        "name": "Literate Agda",
        "info": "Literate Agda allows Agda code to be written intermixed with natural language, much like Literate Haskell, to create an environment where programming and documentation coexist seamlessly.",
        "src": "https://agda.readthedocs.io/en/v2.6.1/tools/literate-programming.html"
    },
    {
        "name": "Literate CoffeeScript",
        "info": "Literate CoffeeScript treats Markdown as a first-class syntax element, allowing CoffeeScript code to be written in Markdown documents for a more readable format that integrates code and documentation.",
        "src": "https://coffeescript.org/#literate"
    },
    {
        "name": "Literate Haskell",
        "info": "Literate Haskell refers to Haskell programs that are written in a mix of Haskell code and human-readable annotations. This approach allows a document to be both a source of documentation and a functional program.",
        "src": "https://downloads.haskell.org/~ghc/latest/docs/html/users_guide/literate_haskell.html"
    },
    {
        "name": "LiveScript",
        "info": "LiveScript is a language that compiles to JavaScript. It is an indirect descendant of CoffeeScript, aiming to be more functional and expressive with a cleaner syntax.",
        "src": "http://livescript.net/"
    },
    {
        "name": "Logos",
        "info": "Logos is a method of patching compiled code in Objective-C, primarily used for development within the iOS jailbreaking community, making it easier to develop tweaks for iOS.",
        "src": "https://iphonedev.wiki/index.php/Logos"
    },
    {
        "name": "Logtalk",
        "info": "Logtalk is an object-oriented logic programming language that can be used with Prolog implementations. It provides a powerful and versatile platform for developing sophisticated applications and multi-paradigm programming.",
        "src": "https://logtalk.org/"
    },
    {
        "name": "LookML",
        "info": "LookML is a language for defining data models, derived tables, and data transformations in Looker. It is used to control data access and to transform raw data into a business-friendly framework that makes it more accessible and actionable to users through Looker dashboards.",
        "src": "https://www.cloudskillsboost.google/course_templates/774"
    },
    {
        "name": "LoomScript",
        "info": "LoomScript is the scripting language used in the Loom SDK, designed for game development. It is statically-typed and uses a syntax similar to ActionScript 3 and JavaScript, offering a powerful and flexible environment for developers to build games and interactive content.",
        "src": "https://loomx.io/"
    },
    {
        "name": "Lua",
        "info": "Lua is a powerful, efficient, lightweight, embeddable scripting language. It supports procedural programming, object-oriented programming, functional programming, data-driven programming, and data description.",
        "src": "https://www.lua.org/"
    },
    {
        "name": "M",
        "info": "M (also known as MUMPS) is a language that provides a built-in database, enabling high-throughput, massive data manipulations, and is commonly used in healthcare applications.",
        "src": "https://mumpsprogramming.com/"
    },
    {
        "name": "M4",
        "info": "M4 is a macro processor language, used in a number of Unix programs as a build dependency to generate reusable and flexible scripts or code.",
        "src": "https://www.gnu.org/software/m4/m4.html"
    },
    {
        "name": "MATLAB",
        "info": "MATLAB is a programming and numeric computing platform used by millions of engineers and scientists to analyze data, develop algorithms, and create models.",
        "src": "https://www.mathworks.com/products/matlab.html"
    },
    {
        "name": "MAXScript",
        "info": "MAXScript is the built-in scripting language for Autodesk 3ds Max, used to automate repetitive tasks, combine existing functionality in new ways, develop new tools and user interfaces, and much more.",
        "src": "https://www.autodesk.com/products/3ds-max/features"
    },
    {
        "name": "MLIR",
        "info": "MLIR (Multi-Level Intermediate Representation) is a library and language-independent design that builds on LLVM's success, introducing a hybrid IR that represents hierarchical and polyhedral compiler optimizations and mappings to hardware.",
        "src": "https://mlir.llvm.org/"
    },
    {
        "name": "MQL4",
        "info": "MQL4 (MetaQuotes Language 4) is a programming language for developing trading strategies for MetaTrader 4 trading platform, primarily used for automated trading and custom indicators.",
        "src": "https://www.metatrader4.com/en/trading-platform/help/autotrading/experts/about"
    },
    {
        "name": "MQL5",
        "info": "MQL5 (MetaQuotes Language 5) is the evolution of MQL4, allowing for more complex trading strategies and tools on the MetaTrader 5 platform. It supports object-oriented programming, a higher execution speed, advanced debugging tools, and improved event handling.",
        "src": "https://www.metatrader5.com/en/terminal/help/start_advanced/mql5_start"
    },
    {
        "name": "MTML",
        "info": "MTML (Mail Template Markup Language) is used for designing email templates. It supports dynamic content generation, allowing marketers to personalize email communications.",
        "src": "https://documentation.mailgun.com/en/latest/user_manual.html#templating"
    },
    {
        "name": "Macaulay2",
        "info": "Macaulay2 is a software system devoted to supporting research in algebraic geometry and commutative algebra, providing tools to compute and explore the properties of explicitly given algebraic structures.",
        "src": "https://macaulay2.com/"
    },
    {
        "name": "Makefile",
        "info": "Makefiles are used to control the build process for software, telling the make utility how to compile and link a program. This tool automates the compilation process, making it more consistent.",
        "src": "https://www.gnu.org/software/make/manual/make.html"
    },
    {
        "name": "Mako",
        "info": "Mako is a high-performance templating language for Python. It provides a familiar, non-XML syntax which compiles into Python modules for maximum performance.",
        "src": "https://www.makotemplates.org/"
    },
    {
        "name": "Markdown",
        "info": "Markdown is a lightweight markup language with plain-text formatting syntax. It is designed for easy readability and writability. Markdown allows HTML elements and offers straightforward formatting, indicated by punctuation marks. It is widely used for formatting readme files, writing messages in online discussion forums, and creating rich text using a plain text editor.",
        "src": "https://en.wikipedia.org/wiki/Markdown"
    },
    {
        "name": "Marko",
        "info": "Marko is a friendly and fast UI library that's fun to use and easy to learn, with a robust API, server-side rendering capabilities, and fine-grained reactivity. It simplifies building web applications with efficient updates from simple templates.",
        "src": "https://markojs.com/"
    },
    {
        "name": "Mask",
        "info": "Mask is a template language that allows the definition of the DOM structure in a concise syntax. It is designed to accelerate the development of component-based web applications by combining templates with scripts and styles.",
        "src": "https://maskjs.org/"
    },
    {
        "name": "Mathematica",
        "info": "Mathematica is a leading system for modern technical computing, providing tools for general computation, visualization, and programming. It integrates capabilities for numerical and symbolic computation, as well as data visualization.",
        "src": "https://www.wolfram.com/mathematica/"
    },
    {
        "name": "Maven POM",
        "info": "Maven Project Object Model (POM) files define project resources, configurations, and directives for building the project using Maven. The POM file is the core of a project's configuration in Maven, detailing dependencies, build plugins, and other configurations.",
        "src": "https://maven.apache.org/pom.html"
    },
    {
        "name": "Max",
        "info": "Max, also known as Max/MSP, is a visual programming language for music and multimedia. It provides musicians, artists, and performers a flexible platform to create software without writing lines of code.",
        "src": "https://cycling74.com/products/max-features"
    },
    {
        "name": "MediaWiki",
        "info": "MediaWiki is a free and open-source wiki software, originally designed for use on Wikipedia. It allows anyone to write and manage content collaboratively. MediaWiki is highly extensible, scalable and customizable.",
        "src": "https://www.mediawiki.org/wiki/MediaWiki"
    },
    {
        "name": "Mercury",
        "info": "Mercury is a functional logic programming language that combines the clarity and expressiveness of declarative programming with advanced static analysis and error detection features.",
        "src": "https://mercurylang.org/"
    },
    {
        "name": "Meson",
        "info": "Meson is a fast and user-friendly build system designed to optimize programmer productivity. It aims to provide stable builds with a simple syntax, supporting several programming languages and requiring fewer dependencies.",
        "src": "https://mesonbuild.com/"
    },
    {
        "name": "Metal",
        "info": "Metal is a low-level, low-overhead hardware-accelerated graphics and compute shader API created by Apple. It allows developers to maximize the graphics and computing potential of apps on iOS, macOS, and tvOS.",
        "src": "https://developer.apple.com/metal/"
    },
    {
        "name": "Microsoft Developer Studio Project",
        "info": "Microsoft Developer Studio Project files (.dsp) are used by Microsoft Visual Studio to store project configurations, file lists, and settings for developing applications and other types of projects.",
        "src": "https://docs.microsoft.com/en-us/previous-versions/visualstudio/visual-studio-6.0/aa240846(v=vs.60)"
    },
    {
        "name": "Mirah",
        "info": "Mirah is a programming language featuring static typing, local type inference and a syntax similar to Ruby. It is designed for performance and Java platform integration, compiling directly to Java bytecode.",
        "src": "https://github.com/mirah/mirah"
    },
    {
        "name": "Modelica",
        "info": "Modelica is an object-oriented, declarative, multi-domain language for component-oriented modeling of complex systems, e.g., systems containing mechanical, electrical, electronic, hydraulic, thermal, control, electric power or process-oriented subcomponents.",
        "src": "https://www.modelica.org/"
    },
    {
        "name": "Modula-2",
        "info": "Modula-2 is a systems programming language designed by Niklaus Wirth that emphasizes strong type checking, modularity, and separate compilation. It is recognized for correcting some deficiencies of Pascal, suitable for education, professional engineering, and real-time embedded systems.",
        "src": "https://www.modula2.org/modula-2.php"
    },
    {
        "name": "Modula-3",
        "info": "Modula-3 is a descendant of the Modula-2 language, designed to support robust modular programming, with features such as objects, classes, and generics. It is notable for its influence on later languages and its focus on safety and simplicity.",
        "src": "https://www.cs.tufts.edu/~nr/cs257/archive/niklaus-wirth/modula-vs-modula2.pdf"
    },
    {
        "name": "Module Management System",
        "info": "Module Management System (MMS) is a build system used primarily on VMS operating systems, designed to manage large projects with interdependencies between modules. It serves a similar purpose to 'make' on UNIX systems.",
        "src": "https://support.hpe.com/hpesc/public/docDisplay?docId=emr_na-c04623189&docLocale=en_US"
    },
    {
        "name": "Monkey",
        "info": "Monkey is a lightweight scripting language targeted at game developers. It is designed for creating small and fast scripts that can be embedded into larger game projects.",
        "src": "http://monkeycoder.co.nz/"
    },
    {
        "name": "Moocode",
        "info": "Moocode is an easy-to-use scripting language aimed at web developers for quickly creating and deploying web applications. It emphasizes simplicity and rapid development.",
        "src": "https://www.moocode.com/"
    },
    {
        "name": "MoonScript",
        "info": "MoonScript is a dynamic scripting language that compiles into Lua. It adds syntactic sugar inspired by CoffeeScript, which simplifies Lua's syntax and supports more direct manipulation of Lua's features.",
        "src": "https://moonscript.org/"
    },
    {
        "name": "Motorola 68K Assembly",
        "info": "Motorola 68K Assembly language is used for programming Motorola's 68K series of microprocessors, known for their use in early personal computers like the Apple Macintosh and the Commodore Amiga.",
        "src": "http://mrjester.hapisan.com/04_MC68/"
    },
    {
        "name": "Mustache",
        "info": "Mustache is a logic-less template syntax used for generating HTML, config files, and other text-based formats. It works by expanding tags in a template using values provided in a hash or object.",
        "src": "https://mustache.github.io/"
    },
    {
        "name": "Myghty",
        "info": "Myghty is a template language inspired by Python's Myghty templating system, providing a powerful solution for controller layer management and embedding Python code within HTML.",
        "src": "http://www.myghty.org/"
    },
    {
        "name": "NASL",
        "info": "NASL (Nessus Attack Scripting Language) is used within the Nessus vulnerability scanner to write plugins and security tests. It allows for custom scanning and automated security auditing.",
        "src": "https://www.tenable.com/documentation/nessus-v2-file-formats-customizing-reports-and-advanced-options"
    },
    {
        "name": "NCL",
        "info": "NCL (NCAR Command Language) is a high-level programming language used mainly for scientific data processing and visualization. It supports array-based operations, which is critical for processing and analyzing large multi-dimensional data sets.",
        "src": "https://www.ncl.ucar.edu/"
    },
    {
        "name": "NPM Config",
        "info": "NPM Config files are used to set configuration parameters for NPM, the package manager for Node.js. This includes settings for proxies, source repositories, and other command defaults.",
        "src": "https://docs.npmjs.com/cli/v7/configuring-npm/npmrc"
    },
    {
        "name": "NSIS",
        "info": "NSIS (Nullsoft Scriptable Install System) is a script-driven installer authoring tool for Microsoft Windows with capabilities to create setups for software applications.",
        "src": "https://nsis.sourceforge.io/"
    },
    {
        "name": "Nearley",
        "info": "Nearley is a fast, feature-rich, and modern parser toolkit for JavaScript. It uses Earley's algorithm for parsing complex data structures and supports dynamic grammar specifications.",
        "src": "https://nearley.js.org/"
    },
    {
        "name": "Nemerle",
        "info": "Nemerle is a high-level statically-typed programming language for .NET platforms. It integrates functional, imperative, and object-oriented features. It supports metaprogramming through macros, and its compiler, which allows for the generation of boilerplate code during compilation, also performs static checks.",
        "src": "https://en.wikipedia.org/wiki/Nemerle"
    },
    {
        "name": "NetLinx",
        "info": "NetLinx is a programming language designed specifically for controlling and managing AV systems in conference rooms, theaters, and other venues. It is developed by AMX as part of its automation and integration solutions.",
        "src": "https://www.amx.com/en-US/product_families/netlinx-integrated-controllers"
    },
    {
        "name": "NetLogo",
        "info": "NetLogo is a multi-agent programmable modeling environment used for simulating natural and social phenomena. It is particularly well-suited for modeling complex systems evolving over time. Agents in NetLogo follow simple rules, but together they can display complex behavior.",
        "src": "https://ccl.northwestern.edu/netlogo/"
    },
    {
        "name": "NewLisp",
        "info": "NewLisp is a Lisp-like, general-purpose scripting language that emphasizes symbol processing, and it offers a deep set of built-in functions for easy programming of text or data applications.",
        "src": "http://www.newlisp.org/"
    },
    {
        "name": "Nextflow",
        "info": "Nextflow enables scalable and reproducible scientific workflows using software containers. It allows the adaptation of pipelines written in the most common scripting languages.",
        "src": "https://www.nextflow.io/"
    },
    {
        "name": "Nginx",
        "info": "Nginx is a web server that can also be used as a reverse proxy, load balancer, mail proxy, and HTTP cache. It provides high performance, stability, and rich feature set which are used extensively for hosting websites.",
        "src": "https://nginx.org/en/"
    },
    {
        "name": "Nim",
        "info": "Nim is a statically typed compiled systems programming language that combines successful concepts from mature languages like Python, Ada, and Modula. It offers powerful features like macro systems, compile-time code execution, and efficient, expressive syntax.",
        "src": "https://nim-lang.org/"
    },
    {
        "name": "Nit",
        "info": "Nit is an expressive language with a script-like syntax, providing a clean and modern object-oriented programming model. It is designed to be robust and efficient, targeting large-scale software engineering.",
        "src": "http://nitlanguage.org/"
    },
    {
        "name": "Nix",
        "info": "Nix is a powerful package manager for Linux and other Unix systems that makes package management reliable and reproducible. It offers a unique approach to package and configuration management, ensuring that installations are reproducible and that dependencies are precisely defined.",
        "src": "https://nixos.org/"
    },
    {
        "name": "Nu",
        "info": "Nu is a lightweight programming language that builds on Lisp and integrates with Objective-C to provide a powerful and flexible programming environment for iOS and macOS development.",
        "src": "https://programming-nu.github.io/"
    },
    {
        "name": "OCaml",
        "info": "OCaml is an industrial strength programming language supporting functional, imperative, and object-oriented styles. It is known for its expressiveness, efficiency, and robust type system.",
        "src": "https://ocaml.org/"
    },
    {
        "name": "Object Data Instance Notation",
        "info": "Object Data Instance Notation (ODIN) is a concise data-interchange format that closely mirrors programming language data structures. It is typically used in scenarios where JSON and XML are deemed too verbose or complex.",
        "src": "https://odin.standard.no/"
    },
    {
        "name": "ObjectScript",
        "info": "ObjectScript is a language used for creating database applications, providing an object-oriented approach to database management. It integrates seamlessly with SQL databases and allows developers to directly interact with database objects.",
        "src": "https://www.intersystems.com/products/cach%C3%A9/objectscript/"
    },
    {
        "name": "Objective-C",
        "info": "Objective-C is a general-purpose, object-oriented programming language that adds Smalltalk-style messaging to the C programming language. It was the main programming language supported by Apple for macOS and iOS development before being superseded by Swift.",
        "src": "https://developer.apple.com/library/archive/documentation/Cocoa/Conceptual/ProgrammingWithObjectiveC/Introduction/Introduction.html"
    },
    {
        "name": "Objective-C++",
        "info": "Objective-C++ allows the mixing of C++ with Objective-C within the same program, enhancing Objective-C's capabilities with C++ features and libraries. This language extension is useful for developers who need to integrate C++ libraries into Objective-C projects, especially on Apple's platforms.",
        "src": "https://gcc.gnu.org/onlinedocs/gcc-13.0.0/gcc/Objective-C-and-Objective_002dC_002b_002b-Languages.html"
    },
    {
        "name": "Objective-J",
        "info": "Objective-J is a programming language which adds traditional inheritance and Smalltalk-style messaging to JavaScript. It's part of the Cappuccino web application framework, allowing developers to build rich internet applications.",
        "src": "https://cappuccino.org"
    },
    {
        "name": "Odin",
        "info": "Odin is a fast, concise, readable, and pragmatic programming language designed with the intent of replacing C with features facilitating high-performance, real-time systems.",
        "src": "https://odin-lang.org/docs/overview/"
    },
    {
        "name": "Omgrofl",
        "info": "Omgrofl is an esoteric programming language designed to be humorous and challenging. Its commands consist of internet acronyms and meme-related terms.",
        "src": "https://esolangs.org/wiki/Omgrofl"
    },
    {
        "name": "Opa",
        "info": "Opa is a high-level framework designed for web application development, simplifying server-side scripting, web server configuration, and client-side scripting.",
        "src": "https://opalang.org"
    },
    {
        "name": "Opal",
        "info": "Opal is a compiler for writing JavaScript with a Ruby syntax. It compiles Ruby-like source code to JavaScript, enabling Ruby developers to write front-end code in a familiar syntax.",
        "src": "https://opalrb.com/"
    },
    {
        "name": "Open Policy Agent",
        "info": "Open Policy Agent (OPA) is an open source, general-purpose policy engine that unifies policy enforcement across the stack. It decouples policy decision-making from policy enforcement, allowing you to express policies as code.",
        "src": "https://www.openpolicyagent.org/"
    },
    {
        "name": "OpenEdge ABL",
        "info": "OpenEdge Advanced Business Language (ABL) is a business application development language created by Progress Software which is strong in database manipulation and business logic.",
        "src": "https://documentation.progress.com/output/ua/OpenEdge_latest/index.html#page/dvref/openedge-advanced-business-language-(abl).html"
    },
    {
        "name": "OpenQASM",
        "info": "OpenQASM (Open Quantum Assembly Language) is a programming language used for quantum computing. It allows researchers and developers to write quantum algorithms in an assembly-style language, focusing on controlling quantum operations.",
        "src": "https://quantum-computing.ibm.com/"
    },
    {
        "name": "OpenSCAD",
        "info": "OpenSCAD is a software for creating solid 3D CAD objects. It is not an interactive modeler, but rather a 3D compiler based on a textual description language. OpenSCAD provides a scripting language for designing models.",
        "src": "https://www.openscad.org/"
    },
    {
        "name": "OpenStep Property List",
        "info": "OpenStep Property List files are used to store user settings and application data in a structured text format, which can be easily managed by applications running on the OpenStep API.",
        "src": "https://www.gnu.org/software/gnustep/"
    },
    {
        "name": "OpenType Feature File",
        "info": "OpenType Feature Files are part of the font development process and define the behavior of different font features in OpenType fonts. They dictate how text is displayed when certain features are enabled in an OpenType-supporting application.",
        "src": "https://docs.microsoft.com/en-us/typography/opentype/spec/featuretags"
    },
    {
        "name": "Org",
        "info": "Org mode is for keeping notes, maintaining TODO lists, planning projects, and authoring documents with a fast and effective plain-text system.",
        "src": "https://orgmode.org/"
    },
    {
        "name": "Ox",
        "info": "Ox is a statistical software and a matrix programming language, providing an extensive mathematical and statistical function library, which is used predominantly by academics and economists.",
        "src": "https://www.doornik.com/"
    },
    {
        "name": "Oxygene",
        "info": "Oxygene is a modern Object Pascal language from RemObjects Software, designed to bring the power of Object Pascal into the 21st century with support for all major platforms like .NET, Cocoa, Android, Java, Windows, Linux, and WebAssembly. It integrates with IDEs such as Fire, Water, and Visual Studio, offering developers an array of advanced language features.",
        "src": "https://www.remobjects.com/elements/oxygene/"
    },
    {
        "name": "Oz",
        "info": "Oz is a multi-paradigm programming language that is designed for advanced, concurrent, networked, soft real-time, and reactive applications. It combines logic programming, functional programming, and object-oriented programming to allow for a wide range of applications from AI to distributed computing.",
        "src": "https://mozart.github.io/"
    },
    {
        "name": "P4",
        "info": "P4 is a programming language designed for programming protocol-independent packet processors. P4 works by specifying how packets are processed by the data plane of a forwarding element such as a hardware or software switch, router, or network interface card.",
        "src": "https://p4.org/"
    },
    {
        "name": "PHP",
        "info": "PHP is a popular general-purpose scripting language especially suited to web development. Fast, flexible, and pragmatic, PHP powers everything from your blog to the most popular websites in the world.",
        "src": "https://www.php.net/"
    },
    {
        "name": "PLSQL",
        "info": "PL/SQL is Oracle Corporation's procedural extension for SQL and the Oracle relational database. PL/SQL's general syntax resembles that of Ada or Pascal and includes facilities to develop web applications and server pages.",
        "src": "https://www.oracle.com/database/technologies/appdev/plsql.html"
    },
    {
        "name": "PLpgSQL",
        "info": "PL/pgSQL is a procedural language supported by the PostgreSQL ORDBMS. It allows users to create complex functions, perform error handling, and create trigger functions, providing more control and robustness in SQL operations.",
        "src": "https://www.postgresql.org/docs/current/plpgsql.html"
    },
    {
        "name": "POV-Ray SDL",
        "info": "POV-Ray SDL (Scene Description Language) is used to describe images in a scene and produce high-quality three-dimensional graphics with photorealism. It's a powerful tool for creating detailed 3-dimensional scenes.",
        "src": "http://www.povray.org/documentation/"
    },
    {
        "name": "Pan",
        "info": "Pan is a domain-specific language developed by Quattor to automate the configuration of large systems. It is designed to provide a unique, declarative way to define and manage system configurations.",
        "src": "https://www.quattor.org/documentation/2019/12/31/pan-book.html"
    },
    {
        "name": "Papyrus",
        "info": "Papyrus is a scripting language used in creating game behavior and game events for video games such as the Elder Scrolls series, including Skyrim. It is designed to be easy to use for modders and developers to create complex game interactions.",
        "src": "https://www.creationkit.com/index.php?title=Papyrus"
    },
    {
        "name": "Parrot",
        "info": "Parrot is a virtual machine designed to efficiently compile and execute bytecode for dynamic languages. Parrot is highly customizable, making it ideal for dynamic languages such as Perl, Ruby, and Python.",
        "src": "https://www.parrot.org/"
    },
    {
        "name": "Parrot Assembly",
        "info": "Parrot Assembly is an assembly language used with the Parrot virtual machine, allowing for low-level manipulation of Parrot's internals and providing a means to optimize performance for high-level languages.",
        "src": "https://docs.parrot.org/parrot/latest/html/docs/book/pir/index.html"
    },
    {
        "name": "Pascal",
        "info": "Pascal is a high-level procedural programming language widely used as a teaching language for introducing programming concepts and for data structuring and algorithms. It emphasizes structured programming and data structuring.",
        "src": "https://www.freepascal.org/"
    },    
    {
        "name": "Pawn",
        "info": "Pawn is an embeddable, almost typeless, easy-to-use scripting language that is compiled for a virtual machine. It is used primarily for game development and other applications where a small, fast, and efficient scripting language is required.",
        "src": "https://www.compuphase.com/pawn/pawn.htm"
    },
    {
        "name": "Pep8",
        "info": "Pep8 is an educational assembly language used to teach computer organization and introduces students to the concepts of assembly language programming and computer architecture.",
        "src": "https://code.google.com/archive/p/pep8-1/"
    },
    {
        "name": "Perl",
        "info": "Perl is a high-level, general-purpose, interpreted, dynamic programming language known for its powerful text processing capabilities. Perl supports both procedural and object-oriented programming.",
        "src": "https://www.perl.org/"
    },
    {
        "name": "PicoLisp",
        "info": "PicoLisp is a minimalist dialect of Lisp, which emphasizes simplicity and a small language core, offering a straightforward approach to object-oriented programming and symbolic processing.",
        "src": "https://picolisp.com/wiki/?home"
    },
    {
        "name": "PigLatin",
        "info": "PigLatin is a high-level platform for creating MapReduce programs used with Apache Hadoop. The language is designed to simplify writing complex data transformations and processing tasks.",
        "src": "https://pig.apache.org/"
    },
    {
        "name": "Pike",
        "info": "Pike is a dynamic programming language with a syntax similar to C and Java. It is designed for applications development and is often used in web applications, multimedia processing, and as a scriptable configuration language.",
        "src": "https://pike.lysator.liu.se/"
    },
    {
        "name": "PlantUML",
        "info": "PlantUML is a tool allowing users to create UML diagrams from a plain text language. It supports various UML diagrams types, sequence diagrams, and allows for diagrams to be generated in several graphic formats.",
        "src": "https://plantuml.com/"
    },
    {
        "name": "Pod",
        "info": "Pod, or Plain Old Documentation, is a simple-to-use markup language used for writing documentation for Perl, Perl programs, and Perl modules.",
        "src": "https://perldoc.perl.org/perlpod.html"
    },
    {
        "name": "PogoScript",
        "info": "PogoScript is a programming language that compiles down to JavaScript, featuring a readable syntax that encourages asynchronous programming and expressive code.",
        "src": "https://pogoscript.org/"
    },
    {
        "name": "Pony",
        "info": "Pony is an open-source, object-oriented, actor-model, capabilities-secure, high-performance programming language. It ensures deadlock-free concurrency and built-in data race prevention mechanisms.",
        "src": "https://www.ponylang.io/"
    },
    {
        "name": "PostScript",
        "info": "PostScript is a page description language used primarily in the electronic and desktop publishing areas for defining the contents and layout of a printed page, which can be used to describe images, text, and vector graphics.",
        "src": "https://www.adobe.com/content/dam/acom/en/devnet/actionscript/articles/PLRM.pdf"
    },
    {
        "name": "PowerBuilder",
        "info": "PowerBuilder is an integrated development environment owned by SAP that allows for rapid application development of visually rich, database-driven applications.",
        "src": "https://www.appeon.com/products/powerbuilder"
    },
    {
        "name": "PowerShell",
        "info": "PowerShell is a task automation and configuration management framework from Microsoft, consisting of a command-line shell and the associated scripting language built on the .NET Framework.",
        "src": "https://docs.microsoft.com/en-us/powershell/"
    },
    {
        "name": "Processing",
        "info": "Processing is a flexible software sketchbook and a language for learning how to code within the context of the visual arts, primarily used to create graphics and interactive media art.",
        "src": "https://processing.org/"
    },
    {
        "name": "Proguard",
        "info": "Proguard is a versatile tool to shrink, optimize, and obfuscate Java bytecode. It makes Java and Android applications up to 90% smaller and up to 20% faster.",
        "src": "https://www.guardsquare.com/en/products/proguard"
    },
    {
        "name": "Prolog",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Propeller Spin",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Protocol Buffer",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Public Key",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Pug",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Puppet",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Pure Data",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "PureBasic",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "PureScript",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Python",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Python console",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Python traceback",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Q#",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "QML",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "QMake",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Qt Script",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Quake",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "R",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "RAML",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "RDoc",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "REALbasic",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "REXX",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "RMarkdown",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "RPC",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "RPM Spec",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "RUNOFF",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Racket",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Ragel",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Raku",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Rascal",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Reason",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Rebol",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Red",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Redcode",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Regular Expression",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Ren'Py",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "RenderScript",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Rich Text Format",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Ring",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Riot",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "RobotFramework",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Roff",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Roff Manpage",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Rouge",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Ruby",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Rust",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "SAS",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "SCSS",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "SMT",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "SQF",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "SQL",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "SQLPL",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "SRecode Template",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "SSH Config",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "SVG",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "SWIG",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Sage",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "SaltStack",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Sass",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Scala",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Scheme",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Scilab",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Self",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "ShaderLab",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Shell",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Shen",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Sieve",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Slash",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Slice",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Slim",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "SmPL",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Smali",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Smalltalk",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Smarty",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Solidity",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "SourcePawn",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Spline Font Database",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Squirrel",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Stan",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Standard ML",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Starlark",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Stata",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Stylus",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "SubRip Text",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "SugarSS",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "SuperCollider",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Svelte",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Swift",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "SystemVerilog",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "TI Program",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "TLA",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "TOML",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "TSQL",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "TSV",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "TXL",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Tcl",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "TeX",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Tea",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Terra",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Texinfo",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Text",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Textile",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Thrift",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Turing",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Turtle",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Twig",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Type Language",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "TypeScript",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Unified Parallel C",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Unity3D Asset",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Unix Assembly",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Uno",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "UnrealScript",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "UrWeb",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "V",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "VBA",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "VBScript",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "VCL",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "VHDL",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Vala",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Verilog",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Vim Help File",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Vim Snippet",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Vim script",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Visual Basic .NET",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Volt",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Vue",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Wavefront Material",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Wavefront Object",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Web Ontology Language",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "WebAssembly",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "WebIDL",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "WebVTT",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Wget Config",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Windows Registry Entries",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Wollok",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "World of Warcraft Addon Data",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "X BitMap",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "X Font Directory Index",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "X PixMap",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "X10",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "XC",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "XML",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "XPages",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "XProc",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "XQuery",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "XS",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "XSLT",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Xojo",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Xtend",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "YAML",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "YANG",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "YARA",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "YASnippet",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Yacc",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "ZAP",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "ZIL",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Zeek",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "ZenScript",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Zephir",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Zig",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "Zimpl",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "cURL Config",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "desktop",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "eC",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "go",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "java",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "javascript",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "mIRC Script",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "mcfunction",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "mupad",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "nesC",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "ooc",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "python",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "q",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "reStructuredText",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "ruby",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "sed",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "wdl",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "wisp",
        "info": "NA",
        "src": "NA"
    },
    {
        "name": "xBase",
        "info": "NA",
        "src": "NA"
    }
]
