[
    {
        "name": "flux",
        "description": "Flux is a lightweight scripting language for querying databases (like InfluxDB) and working with data. It's part of InfluxDB 1.7 and 2.0, but can be run independently of those.",
        "languages": {
            "FLUX": 5754787,
            "Go": 5652600,
            "Rust": 4076947,
            "Ragel": 153545,
            "Shell": 21482,
            "C": 12975,
            "Makefile": 7542,
            "HTML": 4102,
            "Python": 1071,
            "Dockerfile": 184
        }
    },
    {
        "name": "fluXpipe",
        "description": "TLDR: Flux for InfluxDB 3.0. Stand-alone, Serverless Flux API/Pipeline for querying, analyzing and interacting with remote data.",
        "languages": {
            "FLUX": 11216,
            "Go": 7807,
            "Shell": 627,
            "Dockerfile": 400
        }
    },
    {
        "name": "soundcloud-fb2k-waveform-seekbar",
        "description": "SoundCloud Theme for Foobar2000 Waveform Seekbar Plugin",
        "languages": {
            "FLUX": 6610
        }
    },
    {
        "name": "Tooools",
        "description": "Patchtools based on vvvv",
        "languages": {
            "FLUX": 57073
        }
    },
    {
        "name": "PIHM",
        "description": "The Penn State Integrated Hydrologic Model (PIHM) is a fully coupled multiprocess hydrologic model. Instead of coupling through artificial boundary conditions, major hydrological processes are fully coupled by the semi-discrete finite volume approach. For those processes whose governing equations are partial differential equations (PDE), we first discretize in space via the finite volume method. This results in a system of ordinary differential equations (ODE) representing those procesess within the control volume. Within the same control volume, combining other processes whose governing equations are ODE’s, (e.g. the snow accumulation and melt process), a local ODE system is formed for the complete dynamics of the finite volume. After assembling the local ODE system throughout the entire domain, the global ODE system is formed and solved by a state-of-art ODE solver.",
        "languages": {
            "FLUX": 9677100,
            "C": 818571,
            "Makefile": 7495
        }
    }
]