[
    {
        "name": "MOO-stuff",
        "description": "Various objects, verbs, and patches I've written for use with the LambdaMOO server",
        "languages": {
            "Moocode": 114163
        }
    },
    {
        "name": "Projet-Fil-Rouge-2021-events",
        "description": "Dans le cadre du projet fil rouge chaque apprenant a proposé un cahier des charges pour une idée innovante qui a été validé par sa formatrice.  vous êtes amené à travailler sur le cahier des charges approprié à votre contexte (voir le drive en PJ)  toute en respectant les instructions suivantes:  utiliser le diagramme de Gantt pour planifier votre travail.  Réaliser une maquette et un prototype (web/mobile) simulant votre Projet.  Réaliser une charte graphique pour votre Projet.  Les pages web doivent être responsive et respecter le prototype, la charte graphique et l’UX/UI  Vous êtes amenés à être créatif en proposant du contenu adapté (texte correcte /et images).  les champs de vos interfaces de votre site doivent respecter les contraintes de validation ex: - le champs numéro téléphone ne doit pas accepter les caractères. vérifier les champs : CIN, Email,....  la platform doit permettre l'authentification et la gestion des multi-Profil (ex: Admin, utilisateur, Client..)  Réaliser la conception et la modélisation avec l’UML  Diagramme de cas d’utilisation  Diagramme de séquence  Diagramme de classes  la platform doit offrir les fonctionnalités : Creat,Read,Update,Delete,Search,...  vous pouvez utiliser les API ou plugin pour améliorer les Fonctionnalités de votre site(ex: Calendrier, Video, Chat,..)  Choix Technologique:  Front-End : HTML5, CSS3,SASS, javascript, Bootstrap, VueJS,...  Base de donnée : MySql  Backend : PHP/POO/MVC ou utiliser le framework Laravel  Bonne chance et bon courage à vous tous.",
        "languages": {
            "Moocode": 323904,
            "Boo": 255656,
            "PHP": 127914,
            "Blade": 90759,
            "Shell": 869
        }
    },
    {
        "name": "moocode",
        "description": "LambdaMOO object code.",
        "languages": {
            "Moocode": 34961,
            "Mercury": 9048
        }
    },
    {
        "name": "database",
        "description": null,
        "languages": {
            "Moocode": 85689
        }
    },
    {
        "name": "pasture1-verbs",
        "description": null,
        "languages": {
            "Moocode": 1547143
        }
    }
]