[
    {
        "name": "redis",
        "description": "Redis is an in-memory database that persists on disk. The data model is key-value, but many different kind of values are supported: Strings, Lists, Sets, Sorted Sets, Hashes, Streams, HyperLogLogs, Bitmaps.",
        "languages": {
            "C": 6385298,
            "Tcl": 2142262,
            "Python": 40062,
            "Shell": 23545,
            "Ruby": 23513,
            "Makefile": 20797,
            "C++": 5987,
            "Smarty": 1047,
            "JavaScript": 953
        }
    },
    {
        "name": "WaveFunctionCollapse",
        "description": "Bitmap & tilemap generation from a single example with the help of ideas from quantum mechanics",
        "languages": {
            "C#": 26953
        }
    },
    {
        "name": "xUtils3",
        "description": "Android orm, bitmap, http, view inject... ",
        "languages": {
            "Java": 436636
        }
    },
    {
        "name": "android-common",
        "description": "Android Common Utils or Helper. Such as Log, Averager, Base64, Check, FlashLight, KeyguardLock, LogReader, Network, SilentInstaller, TimeAverager, TimeCounter, Toastor, WakeLock, ScreenReceiver, SmsReceiver, PhoneReceiver, NotificationService, AndroidUtil, AppUtil, BitmapUtil, ByteUtil, ClassUtil, DialogUtil, FieldUtil, FileUtil, HexUtil, MD5Util, NotificationUtil, NumberUtil, PackageUtil, RandomUtil, ShellUtil, TelephoneUtil, VibrateUtil, IOUtils, FileUtils, AsyncExecutor, etc.  通用性强，纯洁简单，体积不到50K！其中包括bitmap处理，文件操作，加密存储器，shell命令，静默安装，计数器，均值器，吐司，日志，校验，提示，网络监测等基础功能，以及一些Base64、MD5、Hex、Byte、Number、Dialog、Filed、Class、Package、Telephone、Random等工具类。",
        "languages": {
            "Java": 495309
        }
    },
    {
        "name": "android-stackblur",
        "description": "Android StackBlur is a library that can perform a blurry effect on a Bitmap based on a gradient or radius, and return the result. The library is based on the code of Mario Klingemann.",
        "languages": {
            "Java": 37388,
            "C": 24346,
            "RenderScript": 21402,
            "Makefile": 14254
        }
    }
]